_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_1 (TimeDist (None, 20, 60, 80, 32)    1600      
_________________________________________________________________
time_distributed_2 (TimeDist (None, 20, 60, 80, 32)    128       
_________________________________________________________________
time_distributed_3 (TimeDist (None, 20, 60, 80, 32)    0         
_________________________________________________________________
time_distributed_4 (TimeDist (None, 20, 58, 78, 32)    9248      
_________________________________________________________________
time_distributed_5 (TimeDist (None, 20, 58, 78, 32)    128       
_________________________________________________________________
time_distributed_6 (TimeDist (None, 20, 58, 78, 32)    0         
_________________________________________________________________
time_distributed_7 (TimeDist (None, 20, 29, 39, 32)    0         
_________________________________________________________________
time_distributed_8 (TimeDist (None, 20, 29, 39, 64)    18496     
_________________________________________________________________
time_distributed_9 (TimeDist (None, 20, 29, 39, 64)    256       
_________________________________________________________________
time_distributed_10 (TimeDis (None, 20, 29, 39, 64)    0         
_________________________________________________________________
time_distributed_11 (TimeDis (None, 20, 29, 39, 64)    36928     
_________________________________________________________________
time_distributed_12 (TimeDis (None, 20, 29, 39, 64)    256       
_________________________________________________________________
time_distributed_13 (TimeDis (None, 20, 29, 39, 64)    0         
_________________________________________________________________
time_distributed_14 (TimeDis (None, 20, 14, 19, 64)    0         
_________________________________________________________________
time_distributed_15 (TimeDis (None, 20, 14, 19, 128)   73856     
_________________________________________________________________
time_distributed_16 (TimeDis (None, 20, 14, 19, 128)   512       
_________________________________________________________________
time_distributed_17 (TimeDis (None, 20, 14, 19, 128)   0         
_________________________________________________________________
time_distributed_18 (TimeDis (None, 20, 14, 19, 128)   147584    
_________________________________________________________________
time_distributed_19 (TimeDis (None, 20, 14, 19, 128)   512       
_________________________________________________________________
time_distributed_20 (TimeDis (None, 20, 14, 19, 128)   0         
_________________________________________________________________
time_distributed_21 (TimeDis (None, 20, 7, 9, 128)     0         
_________________________________________________________________
time_distributed_22 (TimeDis (None, 20, 7, 9, 256)     295168    
_________________________________________________________________
time_distributed_23 (TimeDis (None, 20, 7, 9, 256)     1024      
_________________________________________________________________
time_distributed_24 (TimeDis (None, 20, 7, 9, 256)     0         
_________________________________________________________________
time_distributed_25 (TimeDis (None, 20, 7, 9, 256)     590080    
_________________________________________________________________
time_distributed_26 (TimeDis (None, 20, 7, 9, 256)     1024      
_________________________________________________________________
time_distributed_27 (TimeDis (None, 20, 7, 9, 256)     0         
_________________________________________________________________
time_distributed_28 (TimeDis (None, 20, 3, 4, 256)     0         
_________________________________________________________________
time_distributed_29 (TimeDis (None, 20, 3, 4, 512)     1180160   
_________________________________________________________________
time_distributed_30 (TimeDis (None, 20, 3, 4, 512)     2048      
_________________________________________________________________
time_distributed_31 (TimeDis (None, 20, 3, 4, 512)     0         
_________________________________________________________________
time_distributed_32 (TimeDis (None, 20, 3, 4, 512)     2359808   
_________________________________________________________________
time_distributed_33 (TimeDis (None, 20, 3, 4, 512)     2048      
_________________________________________________________________
time_distributed_34 (TimeDis (None, 20, 3, 4, 512)     0         
_________________________________________________________________
time_distributed_35 (TimeDis (None, 20, 1, 2, 512)     0         
_________________________________________________________________
time_distributed_36 (TimeDis (None, 20, 1024)          0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 256)               1311744   
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 771       
=================================================================
Total params: 6,033,379
Trainable params: 6,029,411
Non-trainable params: 3,968
_________________________________________________________________
