Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 20, 40, 53, 64)    1792      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 20, 20, 26, 64)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 20, 20, 26, 128)   221312    
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 10, 10, 13, 128)   0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 10, 10, 13, 256)   884992    
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 10, 10, 13, 256)   1769728   
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 5, 5, 6, 256)      0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 5, 5, 6, 512)      3539456   
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 5, 5, 6, 512)      7078400   
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 2, 2, 3, 512)      0         
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 2, 2, 3, 512)      7078400   
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 2, 2, 3, 512)      7078400   
_________________________________________________________________
zero_padding3d_1 (ZeroPaddin (None, 2, 4, 5, 512)      0         
_________________________________________________________________
max_pooling3d_5 (MaxPooling3 (None, 1, 2, 2, 512)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              8392704   
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 12291     
=================================================================
Total params: 52,838,787
Trainable params: 52,838,787
Non-trainable params: 0
_________________________________________________________________
