Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, 256)               416768    
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 771       
=================================================================
Total params: 417,539
Trainable params: 417,539
Non-trainable params: 0
_________________________________________________________________
